# 吾爱破解
pojie_urls = [
    "https://www.52pojie.cn/forum.php?mod=forumdisplay&fid=5&filter=author&orderby=dateline&typeid=378",  # 『脱壳破解区』- web 逆向 - 按发帖时间排序
    "https://www.52pojie.cn/forum.php?mod=forumdisplay&fid=65&filter=author&orderby=dateline",            # 『移动安全区』 - 按发帖时间排序
    # "https://www.52pojie.cn/forum.php?mod=rss&fid=65",  # 『移动安全区』- RSS
]

# 哔哩哔哩
bilibili_bloggers = [
    "308704191",         # @时一十一姐呀
    "358732858",         # @凛音姫
    "27577421",          # @安卓反调试frida检测Neo
    "31025974",          # @r0ysue
    "534838862",         # @小肩膀-逆向安全培训
    "434541052",         # @珍惜Any
    "439348342",         # @和沐阳学逆向
    "1366032025",        # @西门浪0v0
    "4670123",           # @零点520666
    "48179703",          # @B站用户骚神
    "480809815",         # @风と自由
    "1796457925",        # @悦来客栈的老板
    "227452348",         # @陈不不and挽风的逆向
    "500303",            # @二进制科学
    "358764286",         # @会飞ヾ的鱼
    "392040559",         # @白面OVO
    "3493257935850246",  # @nothing__233
    "450412693",         # @HD236300
    "383977952",         # @名字叫阿柒
    "1533897577",        # @漠染千舟
    "633101470",         # @波波老师带你学爬虫
    "3461578481470147",  # @逆向狗都不学
    "521068039",         # @若水0014
    "182558639",         # @可乐还是百事好呀
    "409871996",         # @玩转Code
    "38940666",          # @一燕来去一年冬
    "392333105",         # @猿人学Python
    "397037741",         # @ikun的嘴
    "397155590",         # @QiQi指的是琦琦
    "362235493",         # @下雨天sana

    # =========== 较久没有更新 ===========
    # "36624848",       # @落枫_rain
    # "470244840",      # @安静的小泰迪
    # "247999712",      # @海斯-AlanHays
    # "35242527",       # @回锅炒辣椒
    # "387193381",      # @铭叔_
    # "81216470",       # @纷羽逍遥
    # "472444378",      # @夜幕NightTeam
    # "453818250",      # @陈公子的话
    # "297069821",      # @挽风逆向
    # "9532462",        # @醒醒该干饭了
    # "105035514",      # @逆向不看学历
]

# CSDN
csdn_bloggers = [
    ["weixin_43411585", "十一姐"],
    ["weixin_43582101", "考古学家lx(李玺)"],
    ["qq523176585", "悦来客栈的老板"],
    ["qq_38474570", "鬼手56"],
    ["weixin_44772112", "成功你要成仁啊"],
    ["qq_26079939", "阿J~"],
    ["qiulin_wu", "吴秋霖"],
    ["weixin_43505430", "逆向与爬虫的故事"],
    ["xmx_000", "杨如画."],
    ["qq_40979337", "zk935960518"],
    ["qq_43308242", "时光亦不回首"],
    ["kdl_csdn", "K哥爬虫"],
    ["w1101662433", "王辉辉的猫"],
    ["qq_44657571", "逆向学习之旅"],
    ["weixin_47115747", "`Jay"],
    ["weixin_44437016", "y小白的笔记"],
    ["u010559109", "r0ysue_"],
    ["m0_52336378", "半离岛"],
    ["jia666666", "jia666666"],
    ["qq_36780279", "星云牛马"],
    ["pyzzd", "BuerCC"],
    ["weixin_46874932", "Sping__"],
    ["weixin_44691004", "A九三"],
    ["weixin_45307278", "Nickname肖知寒"],
    ["qq_63701832", "coleak"],
    ["weixin_45541986", "一位路过的程序员"],
    ["qq_38851536", "白龙~"],
    ["qq_44749634", "写BUG专家"],
    ["jerry3747", "逆向三十六计"],
    ["weixin_38927522", "Codeooo"],
    ["c_kongfei", "小道安全"],
    ["qq_43704986", "Mint.Coder"],
    ["m0_51159233", "追风暴的人"],
    ["big_god_", "活捉一只小菜鸟~"],
    ["weixin_44862184", "挽风逆向"],
    ["weixin_58584029", "西楚傲天"],
    ["Y_morph", "I am geekbyte"],
    ["zjq592767809", "渔滒"],
    ["weixin_44504978", "_花爷"],
    ["Qiled", "Qiled"],
    ["qq_46013295", "不不不我要摸鱼"],
    ["qq_41155858", "和沐阳学逆向"],
    ["u010671061", "移动安全星球"],
    ["qq_33403388", "十二有bug"],
    ["u013046615", "爬虫小恐龙"],
    ["qq409732112", "公过水蚊"],
    ["weixin_46672080", "逆向新手"],
    ["qq_38154948", "拉灯的小手"],
    ["u014431237", "AnxiangLemon"],
    ["qq_44657899", "_Herbert555"],
    ["yyz_yinyuanzhang", "Mick Schumacher"],
    ["Bennett_", "LuoYe丶"],
    ["qq_21050249", "故意~"],
    ["qq_43572758", "看见我书了吗"],
    ["Zuko_chen", "始識"],
    ["NUT_0", "NUT_0"],
    ["weixin_52283613", "八月欢喜"],
    ["hdd706", "hdd706"],
    ["qq_38977435", "Amazing__W"],
    ["qq_49268524", "小爬菜"],
    ["ckcookies", "ckcookies"],
    ["weixin_42277380", "飞向天空的鹰"],
    ["A_fanyifan", "带带弟弟学爬虫__"],
    ["2401_84054263", "菜鸟逆向"],
    ["mamenqi_csdn", "傲娇的小苹果"],
    ["w62181310", "轩辕丿"],
    ["m0_46631208", "白寸(渴～知)"],
    ["weixin_39010615", "孤独的三毛"],
    ["2301_78252288", "2301_78252288"],
    ["weixin_52001594", "花庭"],
    ["m0_75266682", "呆呆怪和酷酷妖"],
    ["y662225dd", "一本杂志"],
    ["u010226586", "我是花臂不花"],
    ["ljc545w", "勇敢自由"],
    ["qq_36551453", "码王吴彦祖"],
    ["qq_44906798", "夜无霄"],
    ["weixin_69490628", "汉斯鲁昂"],
    ["Qwertyuiop2016", "Python成长路"],
    ["Leetengteng", "别None了"],
    ["welggy", "onejane"],
    ["weixin_44791631", "扁舟·TF"],
    ["qq_47459180", "Wy01688king"],
    ["L1416279170", "溏心蛋*"],
    ["weixin_43845191", "九月镇灵将"],
    ["m0_62945506", "~贝母~"],
    ["m0_38098782", "CgfFan"],
    ["weixin_41259961", "猫先森_"],
    ["laoyaogegeg", "LY㊋"],
    ["sergiojune", "sergiojune"],
    ["bluedream21str", "心之筑"],
    ["Fleehom", "Crazy ProMonkey"],
    ["Python_DJ", "Python 键盘上的舞者"],
    ["weixin_43459158", "AJackpot"],
    ["2401_83253228", "比奇堡~"],
    ["weixin_44236034", "Good Iead"],
    ["qq_15326513", "qq_15326513"],
    ["qq_30135181", "Tasfa"],
    ["qq_39802740", "qq_39802740"],
    ["u014643814", "小白白"],
    ["w2sft", "w2sfot"],

    # =========== 较久没有更新 ===========
    # ["qq_36759224", "IT.BOB"],
    # ["weixin_43189702", "咸鱼学 Python"],
    # ["weixin_47202458", "一生向风"],
    # ["NoAttack", "NoAttack"],
    # ["nightteam", "夜幕NightTeam"],
    # ["qq_42857999", "帯泪的鱼"],
    # ["weixin_49859373", "学狙人。"],
    # ["weixin_45263074", "q531315380"],
    # ["weixin_56684059", "憨憨.902"],
    # ["m0_65303862", "来年五月"],
    # ["qq_41866988", "Charles-L"],
    # ["qq_46587759", "逆向小小白"],
    # ["qq_36291294", "我的眼里只有bug"],
    # ["weixin_56199707", "小韩叶子"],
    # ["baoshuowl", "mankvis"],
    # ["Ig_thehao", "久见Bug了"],
    # ["qq_42279077", "LeeGene.."],
    # ["qq_45491537", "tiebanggg"],
    # ["weixin_49701447", "香芋味的猫"],
    # ["qq_39551311", ".含笑."],
    # ["qq_48888764", "默默无闻的小韭菜"],
    # ["qq_38999456", "向北丶"],
]

# 看雪社区
kanxue_urls = [
    "https://bbs.kanxue.com/forum-161-1.htm?orderby=tid&digest=0",  # 看雪社区 > 移动安全 > Android安全
    "https://bbs.kanxue.com/forum-166-1.htm?orderby=tid&digest=0",  # 看雪社区 > 移动安全 > iOS安全
    "https://bbs.kanxue.com/forum-151-1.htm?orderby=tid&digest=0",  # 看雪社区 > CTF > WEB安全
]

# 先知社区
xz_url = "https://xz.aliyun.com/node/17"
